teleportboy/arm7_adc_imx8mp/board/pin_mux.h
#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

#include "board.h"

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/* HDMI_DDC_SDA (number AF22), HDMI_DDC_SDA */
/* Routed pin properties */
#define PINCTRL_HOG_P1_63_PERIPHERAL                                        HDMI   /*!< Peripheral name */
#define PINCTRL_HOG_P1_63_SIGNAL                                        hdmi_sda   /*!< Signal name */
#define PINCTRL_HOG_P1_63_PIN_NAME                                  HDMI_DDC_SDA   /*!< Routed pin name */
#define PINCTRL_HOG_P1_63_LABEL                                   "HDMI_DDC_SDA"   /*!< Label */
#define PINCTRL_HOG_P1_63_NAME                                           "P1_63"   /*!< Identifier */

/* HDMI_DDC_SCL (number AC22), HDMI_DDC_SCL */
/* Routed pin properties */
#define PINCTRL_HOG_P1_70_PERIPHERAL                                        HDMI   /*!< Peripheral name */
#define PINCTRL_HOG_P1_70_SIGNAL                                        hdmi_scl   /*!< Signal name */
#define PINCTRL_HOG_P1_70_PIN_NAME                                  HDMI_DDC_SCL   /*!< Routed pin name */
#define PINCTRL_HOG_P1_70_LABEL                                   "HDMI_DDC_SCL"   /*!< Label */
#define PINCTRL_HOG_P1_70_NAME                                           "P1_70"   /*!< Identifier */

/* HDMI_HPD (number AE22), HDMI_HPD */
/* Routed pin properties */
#define PINCTRL_HOG_P1_92_PERIPHERAL                                        HDMI   /*!< Peripheral name */
#define PINCTRL_HOG_P1_92_SIGNAL                                        hdmi_hpd   /*!< Signal name */
#define PINCTRL_HOG_P1_92_PIN_NAME                                      HDMI_HPD   /*!< Routed pin name */
#define PINCTRL_HOG_P1_92_LABEL                                       "HDMI_HPD"   /*!< Label */
#define PINCTRL_HOG_P1_92_NAME                                           "P1_92"   /*!< Identifier */

/* HDMI_CEC (number AD22), HDMI_CEC */
/* Routed pin properties */
#define PINCTRL_HOG_P1_85_PERIPHERAL                                        HDMI   /*!< Peripheral name */
#define PINCTRL_HOG_P1_85_SIGNAL                                        hdmi_cec   /*!< Signal name */
#define PINCTRL_HOG_P1_85_PIN_NAME                                      HDMI_CEC   /*!< Routed pin name */
#define PINCTRL_HOG_P1_85_LABEL                                       "HDMI_CEC"   /*!< Label */
#define PINCTRL_HOG_P1_85_NAME                                           "P1_85"   /*!< Identifier */

/* SAI1_MCLK (number AE12), DEPA */
/* Routed pin properties */
#define PINCTRL_HOG_P2_52_PERIPHERAL                                       GPIO4   /*!< Peripheral name */
#define PINCTRL_HOG_P2_52_SIGNAL                                         gpio_io   /*!< Signal name */
#define PINCTRL_HOG_P2_52_CHANNEL                                             20   /*!< Signal channel */
#define PINCTRL_HOG_P2_52_PIN_NAME                                     SAI1_MCLK   /*!< Routed pin name */
#define PINCTRL_HOG_P2_52_LABEL                                           "DEPA"   /*!< Label */
#define PINCTRL_HOG_P2_52_NAME                                           "P2_52"   /*!< Identifier */
#define PINCTRL_HOG_P2_52_DIRECTION                           kGPIO_DigitalInput   /*!< Direction */

/* Symbols to be used with GPIO driver */
#define PINCTRL_HOG_P2_52_GPIO                                             GPIO4   /*!< GPIO peripheral base pointer */
#define PINCTRL_HOG_P2_52_GPIO_PIN                                           20U   /*!< GPIO pin number */
#define PINCTRL_HOG_P2_52_GPIO_PIN_MASK                              (1U << 20U)   /*!< GPIO pin mask */

/* SAI2_RXFS (number AH17), DEPB */
/* Routed pin properties */
#define PINCTRL_HOG_P2_88_PERIPHERAL                                       GPIO4   /*!< Peripheral name */
#define PINCTRL_HOG_P2_88_SIGNAL                                         gpio_io   /*!< Signal name */
#define PINCTRL_HOG_P2_88_CHANNEL                                             21   /*!< Signal channel */
#define PINCTRL_HOG_P2_88_PIN_NAME                                     SAI2_RXFS   /*!< Routed pin name */
#define PINCTRL_HOG_P2_88_LABEL                                           "DEPB"   /*!< Label */
#define PINCTRL_HOG_P2_88_NAME                                           "P2_88"   /*!< Identifier */
#define PINCTRL_HOG_P2_88_DIRECTION                           kGPIO_DigitalInput   /*!< Direction */

/* Symbols to be used with GPIO driver */
#define PINCTRL_HOG_P2_88_GPIO                                             GPIO4   /*!< GPIO peripheral base pointer */
#define PINCTRL_HOG_P2_88_GPIO_PIN                                           21U   /*!< GPIO pin number */
#define PINCTRL_HOG_P2_88_GPIO_PIN_MASK                              (1U << 21U)   /*!< GPIO pin mask */

/* SAI1_TXD0 (number AJ11), DIG */
/* Routed pin properties */
#define PINCTRL_HOG_P2_60_PERIPHERAL                                       GPIO4   /*!< Peripheral name */
#define PINCTRL_HOG_P2_60_SIGNAL                                         gpio_io   /*!< Signal name */
#define PINCTRL_HOG_P2_60_CHANNEL                                             12   /*!< Signal channel */
#define PINCTRL_HOG_P2_60_PIN_NAME                                     SAI1_TXD0   /*!< Routed pin name */
#define PINCTRL_HOG_P2_60_LABEL                                            "DIG"   /*!< Label */
#define PINCTRL_HOG_P2_60_NAME                                           "P2_60"   /*!< Identifier */
#define PINCTRL_HOG_P2_60_DIRECTION                           kGPIO_DigitalInput   /*!< Direction */

/* Symbols to be used with GPIO driver */
#define PINCTRL_HOG_P2_60_GPIO                                             GPIO4   /*!< GPIO peripheral base pointer */
#define PINCTRL_HOG_P2_60_GPIO_PIN                                           12U   /*!< GPIO pin number */
#define PINCTRL_HOG_P2_60_GPIO_PIN_MASK                              (1U << 12U)   /*!< GPIO pin mask */

/* SAI1_TXD7 (number AJ13), ROT */
/* Routed pin properties */
#define PINCTRL_HOG_P1_60_PERIPHERAL                                       GPIO4   /*!< Peripheral name */
#define PINCTRL_HOG_P1_60_SIGNAL                                         gpio_io   /*!< Signal name */
#define PINCTRL_HOG_P1_60_CHANNEL                                             19   /*!< Signal channel */
#define PINCTRL_HOG_P1_60_PIN_NAME                                     SAI1_TXD7   /*!< Routed pin name */
#define PINCTRL_HOG_P1_60_LABEL                                            "ROT"   /*!< Label */
#define PINCTRL_HOG_P1_60_NAME                                           "P1_60"   /*!< Identifier */
#define PINCTRL_HOG_P1_60_DIRECTION                           kGPIO_DigitalInput   /*!< Direction */

