teleportboy/arm7_adc_imx8mp/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define PINCTRL_HOG_P1_60_GPIO                                             GPIO4   /*!< GPIO peripheral base pointer */
#define PINCTRL_HOG_P1_60_GPIO_PIN                                           19U   /*!< GPIO pin number */
#define PINCTRL_HOG_P1_60_GPIO_PIN_MASK                              (1U << 19U)   /*!< GPIO pin mask */

/* SAI5_RXC (number AD14), FLT */
/* Routed pin properties */
#define PINCTRL_HOG_P1_89_PERIPHERAL                                       GPIO3   /*!< Peripheral name */
#define PINCTRL_HOG_P1_89_SIGNAL                                         gpio_io   /*!< Signal name */
#define PINCTRL_HOG_P1_89_CHANNEL                                             20   /*!< Signal channel */
#define PINCTRL_HOG_P1_89_PIN_NAME                                      SAI5_RXC   /*!< Routed pin name */
#define PINCTRL_HOG_P1_89_LABEL                                            "FLT"   /*!< Label */
#define PINCTRL_HOG_P1_89_NAME                                           "P1_89"   /*!< Identifier */
#define PINCTRL_HOG_P1_89_DIRECTION                           kGPIO_DigitalInput   /*!< Direction */

/* Symbols to be used with GPIO driver */
#define PINCTRL_HOG_P1_89_GPIO                                             GPIO3   /*!< GPIO peripheral base pointer */
#define PINCTRL_HOG_P1_89_GPIO_PIN                                           20U   /*!< GPIO pin number */
#define PINCTRL_HOG_P1_89_GPIO_PIN_MASK                              (1U << 20U)   /*!< GPIO pin mask */

/* SPDIF_EXT_CLK (number AC18), DIM */
/* Routed pin properties */
#define PINCTRL_BACKLIGHT_P1_77_PERIPHERAL                                  PWM1   /*!< Peripheral name */
#define PINCTRL_BACKLIGHT_P1_77_SIGNAL                                   pwm_out   /*!< Signal name */
#define PINCTRL_BACKLIGHT_P1_77_PIN_NAME                           SPDIF_EXT_CLK   /*!< Routed pin name */
#define PINCTRL_BACKLIGHT_P1_77_LABEL                                      "DIM"   /*!< Label */
#define PINCTRL_BACKLIGHT_P1_77_NAME                                     "P1_77"   /*!< Identifier */

/* I2C4_SCL (number AF8), MISO */
/* Routed pin properties */
#define PINCTRL_ADC_P2_90_PERIPHERAL                                      ECSPI2   /*!< Peripheral name */
#define PINCTRL_ADC_P2_90_SIGNAL                                      ecspi_miso   /*!< Signal name */
#define PINCTRL_ADC_P2_90_PIN_NAME                                      I2C4_SCL   /*!< Routed pin name */
#define PINCTRL_ADC_P2_90_LABEL                                           "MISO"   /*!< Label */
#define PINCTRL_ADC_P2_90_NAME                                           "P2_90"   /*!< Identifier */

/* I2C3_SDA (number AJ6), MOSI */
/* Routed pin properties */
#define PINCTRL_ADC_P1_91_PERIPHERAL                                      ECSPI2   /*!< Peripheral name */
#define PINCTRL_ADC_P1_91_SIGNAL                                      ecspi_mosi   /*!< Signal name */
#define PINCTRL_ADC_P1_91_PIN_NAME                                      I2C3_SDA   /*!< Routed pin name */
#define PINCTRL_ADC_P1_91_LABEL                                           "MOSI"   /*!< Label */
#define PINCTRL_ADC_P1_91_NAME                                           "P1_91"   /*!< Identifier */

/* I2C3_SCL (number AJ7), SCLK */
/* Routed pin properties */
#define PINCTRL_ADC_P1_94_PERIPHERAL                                      ECSPI2   /*!< Peripheral name */
#define PINCTRL_ADC_P1_94_SIGNAL                                      ecspi_sclk   /*!< Signal name */
#define PINCTRL_ADC_P1_94_PIN_NAME                                      I2C3_SCL   /*!< Routed pin name */
#define PINCTRL_ADC_P1_94_LABEL                                           "SCLK"   /*!< Label */
#define PINCTRL_ADC_P1_94_NAME                                           "P1_94"   /*!< Identifier */

/* ECSPI2_SS0 (number AJ22), CS */
/* Routed pin properties */
#define PINCTRL_ADC_P2_91_PERIPHERAL                                      ECSPI2   /*!< Peripheral name */
#define PINCTRL_ADC_P2_91_SIGNAL                                        ecspi_ss   /*!< Signal name */
#define PINCTRL_ADC_P2_91_CHANNEL                                              0   /*!< Signal channel */
#define PINCTRL_ADC_P2_91_PIN_NAME                                    ECSPI2_SS0   /*!< Routed pin name */
#define PINCTRL_ADC_P2_91_LABEL                                             "CS"   /*!< Label */
#define PINCTRL_ADC_P2_91_NAME                                           "P2_91"   /*!< Identifier */

/* SAI3_RXD (number AF18), BAT_CE */
/* Routed pin properties */
#define PINCTRL_ADC_P1_28_PERIPHERAL                                       GPIO4   /*!< Peripheral name */
#define PINCTRL_ADC_P1_28_SIGNAL                                         gpio_io   /*!< Signal name */
#define PINCTRL_ADC_P1_28_CHANNEL                                             30   /*!< Signal channel */
#define PINCTRL_ADC_P1_28_PIN_NAME                                      SAI3_RXD   /*!< Routed pin name */
#define PINCTRL_ADC_P1_28_LABEL                                         "BAT_CE"   /*!< Label */
#define PINCTRL_ADC_P1_28_NAME                                           "P1_28"   /*!< Identifier */
#define PINCTRL_ADC_P1_28_DIRECTION                           kGPIO_DigitalInput   /*!< Direction */

/* Symbols to be used with GPIO driver */
#define PINCTRL_ADC_P1_28_GPIO                                             GPIO4   /*!< GPIO peripheral base pointer */
#define PINCTRL_ADC_P1_28_GPIO_PIN                                           30U   /*!< GPIO pin number */
#define PINCTRL_ADC_P1_28_GPIO_PIN_MASK                              (1U << 30U)   /*!< GPIO pin mask */

/* SD1_CLK (coord W28), MDIO_CLK */
/* Routed pin properties */
#define PINCTRL_FEC_P2_68_PERIPHERAL                                       ENET1   /*!< Peripheral name */
#define PINCTRL_FEC_P2_68_SIGNAL                                        enet_mdc   /*!< Signal name */
#define PINCTRL_FEC_P2_68_PIN_NAME                                       SD1_CLK   /*!< Routed pin name */
#define PINCTRL_FEC_P2_68_LABEL                                       "MDIO_CLK"   /*!< Label */
#define PINCTRL_FEC_P2_68_NAME                                           "P2_68"   /*!< Identifier */

/* SD1_CMD (coord W29), MDIO_DATA */
/* Routed pin properties */
#define PINCTRL_FEC_P2_70_PERIPHERAL                                       ENET1   /*!< Peripheral name */
#define PINCTRL_FEC_P2_70_SIGNAL                                       enet_mdio   /*!< Signal name */
#define PINCTRL_FEC_P2_70_PIN_NAME                                       SD1_CMD   /*!< Routed pin name */
#define PINCTRL_FEC_P2_70_LABEL                                      "MDIO_DATA"   /*!< Label */
#define PINCTRL_FEC_P2_70_NAME                                           "P2_70"   /*!< Identifier */

/* SD1_DATA2 (coord V29), RGMII1_RXD0 */
/* Routed pin properties */
#define PINCTRL_FEC_P2_41_PERIPHERAL                                       ENET1   /*!< Peripheral name */
#define PINCTRL_FEC_P2_41_SIGNAL                                   enet_rgmii_rd   /*!< Signal name */
#define PINCTRL_FEC_P2_41_CHANNEL                                              0   /*!< Signal channel */
#define PINCTRL_FEC_P2_41_PIN_NAME                                     SD1_DATA2   /*!< Routed pin name */
#define PINCTRL_FEC_P2_41_LABEL                                    "RGMII1_RXD0"   /*!< Label */
#define PINCTRL_FEC_P2_41_NAME                                           "P2_41"   /*!< Identifier */

/* SD1_DATA3 (coord V28), RGMII1_RXD1 */
/* Routed pin properties */
#define PINCTRL_FEC_P2_43_PERIPHERAL                                       ENET1   /*!< Peripheral name */
#define PINCTRL_FEC_P2_43_SIGNAL                                   enet_rgmii_rd   /*!< Signal name */
#define PINCTRL_FEC_P2_43_CHANNEL                                              1   /*!< Signal channel */
#define PINCTRL_FEC_P2_43_PIN_NAME                                     SD1_DATA3   /*!< Routed pin name */
#define PINCTRL_FEC_P2_43_LABEL                                    "RGMII1_RXD1"   /*!< Label */
#define PINCTRL_FEC_P2_43_NAME                                           "P2_43"   /*!< Identifier */

/* SAI1_RXD6 (number AH10), RGMII1_RXD2 */
/* Routed pin properties */
#define PINCTRL_FEC_P2_45_PERIPHERAL                                       ENET1   /*!< Peripheral name */
#define PINCTRL_FEC_P2_45_SIGNAL                                   enet_rgmii_rd   /*!< Signal name */
#define PINCTRL_FEC_P2_45_CHANNEL                                              2   /*!< Signal channel */
#define PINCTRL_FEC_P2_45_PIN_NAME                                     SAI1_RXD6   /*!< Routed pin name */
#define PINCTRL_FEC_P2_45_LABEL                                    "RGMII1_RXD2"   /*!< Label */
#define PINCTRL_FEC_P2_45_NAME                                           "P2_45"   /*!< Identifier */

