teleportboy/arm7_adc_imx8mp/board/pin_mux.h
/* SAI1_RXD7 (number AH12), RGMII1_RXD3 */
/* Routed pin properties */
#define PINCTRL_FEC_P2_47_PERIPHERAL                                       ENET1   /*!< Peripheral name */
#define PINCTRL_FEC_P2_47_SIGNAL                                   enet_rgmii_rd   /*!< Signal name */
#define PINCTRL_FEC_P2_47_CHANNEL                                              3   /*!< Signal channel */
#define PINCTRL_FEC_P2_47_PIN_NAME                                     SAI1_RXD7   /*!< Routed pin name */
#define PINCTRL_FEC_P2_47_LABEL                                    "RGMII1_RXD3"   /*!< Label */
#define PINCTRL_FEC_P2_47_NAME                                           "P2_47"   /*!< Identifier */

/* SAI1_TXFS (number AF12), RGMII1_RXCTL */
/* Routed pin properties */
#define PINCTRL_FEC_P2_53_PERIPHERAL                                       ENET1   /*!< Peripheral name */
#define PINCTRL_FEC_P2_53_SIGNAL                               enet_rgmii_rx_ctl   /*!< Signal name */
#define PINCTRL_FEC_P2_53_PIN_NAME                                     SAI1_TXFS   /*!< Routed pin name */
#define PINCTRL_FEC_P2_53_LABEL                                   "RGMII1_RXCTL"   /*!< Label */
#define PINCTRL_FEC_P2_53_NAME                                           "P2_53"   /*!< Identifier */

/* SAI1_TXC (number AJ12), RGMII1_RXC */
/* Routed pin properties */
#define PINCTRL_FEC_P2_55_PERIPHERAL                                       ENET1   /*!< Peripheral name */
#define PINCTRL_FEC_P2_55_SIGNAL                                  enet_rgmii_rxc   /*!< Signal name */
#define PINCTRL_FEC_P2_55_PIN_NAME                                      SAI1_TXC   /*!< Routed pin name */
#define PINCTRL_FEC_P2_55_LABEL                                     "RGMII1_RXC"   /*!< Label */
#define PINCTRL_FEC_P2_55_NAME                                           "P2_55"   /*!< Identifier */

/* SD1_DATA1 (coord Y28), RGMII1_TXD0 */
/* Routed pin properties */
#define PINCTRL_FEC_P2_59_PERIPHERAL                                       ENET1   /*!< Peripheral name */
#define PINCTRL_FEC_P2_59_SIGNAL                                   enet_rgmii_td   /*!< Signal name */
#define PINCTRL_FEC_P2_59_CHANNEL                                              0   /*!< Signal channel */
#define PINCTRL_FEC_P2_59_PIN_NAME                                     SD1_DATA1   /*!< Routed pin name */
#define PINCTRL_FEC_P2_59_LABEL                                    "RGMII1_TXD0"   /*!< Label */
#define PINCTRL_FEC_P2_59_NAME                                           "P2_59"   /*!< Identifier */

/* SD1_DATA0 (coord Y29), RGMII1_TXD1 */
/* Routed pin properties */
#define PINCTRL_FEC_P2_61_PERIPHERAL                                       ENET1   /*!< Peripheral name */
#define PINCTRL_FEC_P2_61_SIGNAL                                   enet_rgmii_td   /*!< Signal name */
#define PINCTRL_FEC_P2_61_CHANNEL                                              1   /*!< Signal channel */
#define PINCTRL_FEC_P2_61_PIN_NAME                                     SD1_DATA0   /*!< Routed pin name */
#define PINCTRL_FEC_P2_61_LABEL                                    "RGMII1_TXD1"   /*!< Label */
#define PINCTRL_FEC_P2_61_NAME                                           "P2_61"   /*!< Identifier */

/* SAI1_TXD2 (number AH11), RGMII1_TXD2 */
/* Routed pin properties */
#define PINCTRL_FEC_P2_63_PERIPHERAL                                       ENET1   /*!< Peripheral name */
#define PINCTRL_FEC_P2_63_SIGNAL                                   enet_rgmii_td   /*!< Signal name */
#define PINCTRL_FEC_P2_63_CHANNEL                                              2   /*!< Signal channel */
#define PINCTRL_FEC_P2_63_PIN_NAME                                     SAI1_TXD2   /*!< Routed pin name */
#define PINCTRL_FEC_P2_63_LABEL                                    "RGMII1_TXD2"   /*!< Label */
#define PINCTRL_FEC_P2_63_NAME                                           "P2_63"   /*!< Identifier */

/* SAI1_TXD3 (number AD12), RGMII1_TXD3 */
/* Routed pin properties */
#define PINCTRL_FEC_P2_65_PERIPHERAL                                       ENET1   /*!< Peripheral name */
#define PINCTRL_FEC_P2_65_SIGNAL                                   enet_rgmii_td   /*!< Signal name */
#define PINCTRL_FEC_P2_65_CHANNEL                                              3   /*!< Signal channel */
#define PINCTRL_FEC_P2_65_PIN_NAME                                     SAI1_TXD3   /*!< Routed pin name */
#define PINCTRL_FEC_P2_65_LABEL                                    "RGMII1_TXD3"   /*!< Label */
#define PINCTRL_FEC_P2_65_NAME                                           "P2_65"   /*!< Identifier */

/* SAI1_TXD4 (number AH13), RGMII1_TXCTL */
/* Routed pin properties */
#define PINCTRL_FEC_P2_67_PERIPHERAL                                       ENET1   /*!< Peripheral name */
#define PINCTRL_FEC_P2_67_SIGNAL                               enet_rgmii_tx_ctl   /*!< Signal name */
#define PINCTRL_FEC_P2_67_PIN_NAME                                     SAI1_TXD4   /*!< Routed pin name */
#define PINCTRL_FEC_P2_67_LABEL                                   "RGMII1_TXCTL"   /*!< Label */
#define PINCTRL_FEC_P2_67_NAME                                           "P2_67"   /*!< Identifier */

/* SAI1_TXD5 (number AH14), RGMII1_TXC */
/* Routed pin properties */
#define PINCTRL_FEC_P2_69_PERIPHERAL                                       ENET1   /*!< Peripheral name */
#define PINCTRL_FEC_P2_69_SIGNAL                                  enet_rgmii_txc   /*!< Signal name */
#define PINCTRL_FEC_P2_69_PIN_NAME                                     SAI1_TXD5   /*!< Routed pin name */
#define PINCTRL_FEC_P2_69_LABEL                                     "RGMII1_TXC"   /*!< Label */
#define PINCTRL_FEC_P2_69_NAME                                           "P2_69"   /*!< Identifier */

/* SD2_WP (number AC26), ETH1_RESET */
/* Routed pin properties */
#define PINCTRL_FEC_P2_49_PERIPHERAL                                       GPIO2   /*!< Peripheral name */
#define PINCTRL_FEC_P2_49_SIGNAL                                         gpio_io   /*!< Signal name */
#define PINCTRL_FEC_P2_49_CHANNEL                                             20   /*!< Signal channel */
#define PINCTRL_FEC_P2_49_PIN_NAME                                        SD2_WP   /*!< Routed pin name */
#define PINCTRL_FEC_P2_49_LABEL                                     "ETH1_RESET"   /*!< Label */
#define PINCTRL_FEC_P2_49_NAME                                           "P2_49"   /*!< Identifier */
#define PINCTRL_FEC_P2_49_DIRECTION                          kGPIO_DigitalOutput   /*!< Direction */

