teleportboy/arm7_adc_imx8mp/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define PINCTRL_FEC_P2_49_GPIO                                             GPIO2   /*!< GPIO peripheral base pointer */
#define PINCTRL_FEC_P2_49_GPIO_PIN                                           20U   /*!< GPIO pin number */
#define PINCTRL_FEC_P2_49_GPIO_PIN_MASK                              (1U << 20U)   /*!< GPIO pin mask */

/* SAI2_TXC (number AH15), CAN1_RX */
/* Routed pin properties */
#define PINCTRL_FLEXCAN1_P1_51_PERIPHERAL                               FLEXCAN1   /*!< Peripheral name */
#define PINCTRL_FLEXCAN1_P1_51_SIGNAL                                     can_rx   /*!< Signal name */
#define PINCTRL_FLEXCAN1_P1_51_PIN_NAME                                 SAI2_TXC   /*!< Routed pin name */
#define PINCTRL_FLEXCAN1_P1_51_LABEL                                   "CAN1_RX"   /*!< Label */
#define PINCTRL_FLEXCAN1_P1_51_NAME                                      "P1_51"   /*!< Identifier */

/* SPDIF_TX (number AE18), USB2_OVC */
/* Routed pin properties */
#define PINCTRL_FLEXCAN1_P1_81_PERIPHERAL                               FLEXCAN1   /*!< Peripheral name */
#define PINCTRL_FLEXCAN1_P1_81_SIGNAL                                     can_tx   /*!< Signal name */
#define PINCTRL_FLEXCAN1_P1_81_PIN_NAME                                 SPDIF_TX   /*!< Routed pin name */
#define PINCTRL_FLEXCAN1_P1_81_LABEL                                  "USB2_OVC"   /*!< Label */
#define PINCTRL_FLEXCAN1_P1_81_NAME                                      "P1_81"   /*!< Identifier */

/* SAI2_MCLK (number AJ15), CAN2_RX */
/* Routed pin properties */
#define PINCTRL_FLEXCAN2_P1_49_PERIPHERAL                               FLEXCAN2   /*!< Peripheral name */
#define PINCTRL_FLEXCAN2_P1_49_SIGNAL                                     can_rx   /*!< Signal name */
#define PINCTRL_FLEXCAN2_P1_49_PIN_NAME                                SAI2_MCLK   /*!< Routed pin name */
#define PINCTRL_FLEXCAN2_P1_49_LABEL                                   "CAN2_RX"   /*!< Label */
#define PINCTRL_FLEXCAN2_P1_49_NAME                                      "P1_49"   /*!< Identifier */

/* SAI2_TXD0 (number AH16), CAN2_TX */
/* Routed pin properties */
#define PINCTRL_FLEXCAN2_P1_33_PERIPHERAL                               FLEXCAN2   /*!< Peripheral name */
#define PINCTRL_FLEXCAN2_P1_33_SIGNAL                                     can_tx   /*!< Signal name */
#define PINCTRL_FLEXCAN2_P1_33_PIN_NAME                                SAI2_TXD0   /*!< Routed pin name */
#define PINCTRL_FLEXCAN2_P1_33_LABEL                                   "CAN2_TX"   /*!< Label */
#define PINCTRL_FLEXCAN2_P1_33_NAME                                      "P1_33"   /*!< Identifier */

/* GPIO1_IO12 (coord A5), N/A */
/* Routed pin properties */
#define PINCTRL_GPIO_LED_InternalPowerLED_PERIPHERAL                     GPIO1   /*!< Peripheral name */
#define PINCTRL_GPIO_LED_InternalPowerLED_SIGNAL                       gpio_io   /*!< Signal name */
#define PINCTRL_GPIO_LED_InternalPowerLED_CHANNEL                           12   /*!< Signal channel */
#define PINCTRL_GPIO_LED_InternalPowerLED_PIN_NAME                  GPIO1_IO12   /*!< Routed pin name */
#define PINCTRL_GPIO_LED_InternalPowerLED_LABEL                          "N/A"   /*!< Label */
#define PINCTRL_GPIO_LED_InternalPowerLED_NAME            "Internal Power LED"   /*!< Identifier */

/* Symbols to be used with GPIO driver */
#define PINCTRL_GPIO_LED_InternalPowerLED_GPIO                           GPIO1   /*!< GPIO peripheral base pointer */
#define PINCTRL_GPIO_LED_InternalPowerLED_GPIO_PIN                         12U   /*!< GPIO pin number */
#define PINCTRL_GPIO_LED_InternalPowerLED_GPIO_PIN_MASK            (1U << 12U)   /*!< GPIO pin mask */

/* DRAM_AC00 (coord J6), N/A */
/* Routed pin properties */
#define PINCTRL_LPDDR4_InternalLPDDR4_PERIPHERAL                           DRAM   /*!< Peripheral name */
#define PINCTRL_LPDDR4_InternalLPDDR4_SIGNAL                            dram_ac   /*!< Signal name */
#define PINCTRL_LPDDR4_InternalLPDDR4_CHANNEL                                00   /*!< Signal channel */
#define PINCTRL_LPDDR4_InternalLPDDR4_PIN_NAME                        DRAM_AC00   /*!< Routed pin name */
#define PINCTRL_LPDDR4_InternalLPDDR4_LABEL                               "N/A"   /*!< Label */
#define PINCTRL_LPDDR4_InternalLPDDR4_NAME                    "Internal LPDDR4"   /*!< Identifier */

/* EARC_AUX (number AH23), N/A */
/* Routed pin properties */
#define PINCTRL_EARC_NotroutedtoP1P2_PERIPHERAL                        EARC   /*!< Peripheral name */
#define PINCTRL_EARC_NotroutedtoP1P2_SIGNAL                        earc_aux   /*!< Signal name */
#define PINCTRL_EARC_NotroutedtoP1P2_PIN_NAME                      EARC_AUX   /*!< Routed pin name */
#define PINCTRL_EARC_NotroutedtoP1P2_LABEL                            "N/A"   /*!< Label */
#define PINCTRL_EARC_NotroutedtoP1P2_NAME            "Not routed to P1, P2"   /*!< Identifier */

/* EARC_N_HPD (number AH22), EARC_N_HPD */
/* Routed pin properties */
#define PINCTRL_EARC_P1_35_PERIPHERAL                                       EARC   /*!< Peripheral name */
#define PINCTRL_EARC_P1_35_SIGNAL                                     earc_n_hpd   /*!< Signal name */
#define PINCTRL_EARC_P1_35_PIN_NAME                                   EARC_N_HPD   /*!< Routed pin name */
#define PINCTRL_EARC_P1_35_LABEL                                    "EARC_N_HPD"   /*!< Label */
#define PINCTRL_EARC_P1_35_NAME                                          "P1_35"   /*!< Identifier */

/* EARC_P_UTIL (number AJ23), EARC_P_UTIL */
/* Routed pin properties */
#define PINCTRL_EARC_P1_37_PERIPHERAL                                       EARC   /*!< Peripheral name */
#define PINCTRL_EARC_P1_37_SIGNAL                                    earc_p_util   /*!< Signal name */
#define PINCTRL_EARC_P1_37_PIN_NAME                                  EARC_P_UTIL   /*!< Routed pin name */
#define PINCTRL_EARC_P1_37_LABEL                                   "EARC_P_UTIL"   /*!< Label */
#define PINCTRL_EARC_P1_37_NAME                                          "P1_37"   /*!< Identifier */

/* HDMI_TX0_N (number AJ25), HDMI_TX0N */
/* Routed pin properties */
#define PINCTRL_HDMI_P1_31_PERIPHERAL                                       HDMI   /*!< Peripheral name */
#define PINCTRL_HDMI_P1_31_SIGNAL                                     hdmi_tx0_n   /*!< Signal name */
#define PINCTRL_HDMI_P1_31_PIN_NAME                                   HDMI_TX0_N   /*!< Routed pin name */
#define PINCTRL_HDMI_P1_31_LABEL                                     "HDMI_TX0N"   /*!< Label */
#define PINCTRL_HDMI_P1_31_NAME                                          "P1_31"   /*!< Identifier */

/* HDMI_TX0_P (number AH25), HDMI_TX0P */
/* Routed pin properties */
#define PINCTRL_HDMI_P1_29_PERIPHERAL                                       HDMI   /*!< Peripheral name */
#define PINCTRL_HDMI_P1_29_SIGNAL                                     hdmi_tx0_p   /*!< Signal name */
#define PINCTRL_HDMI_P1_29_PIN_NAME                                   HDMI_TX0_P   /*!< Routed pin name */
#define PINCTRL_HDMI_P1_29_LABEL                                     "HDMI_TX0P"   /*!< Label */
#define PINCTRL_HDMI_P1_29_NAME                                          "P1_29"   /*!< Identifier */

