teleportboy/arm7_adc_imx8mp/board/pin_mux.h
/* HDMI_TX1_N (number AJ26), HDMI_TX1N */
/* Routed pin properties */
#define PINCTRL_HDMI_P1_41_PERIPHERAL                                       HDMI   /*!< Peripheral name */
#define PINCTRL_HDMI_P1_41_SIGNAL                                     hdmi_tx1_n   /*!< Signal name */
#define PINCTRL_HDMI_P1_41_PIN_NAME                                   HDMI_TX1_N   /*!< Routed pin name */
#define PINCTRL_HDMI_P1_41_LABEL                                     "HDMI_TX1N"   /*!< Label */
#define PINCTRL_HDMI_P1_41_NAME                                          "P1_41"   /*!< Identifier */

/* HDMI_TX1_P (number AH26), HDMI_TX1P */
/* Routed pin properties */
#define PINCTRL_HDMI_P1_39_PERIPHERAL                                       HDMI   /*!< Peripheral name */
#define PINCTRL_HDMI_P1_39_SIGNAL                                     hdmi_tx1_p   /*!< Signal name */
#define PINCTRL_HDMI_P1_39_PIN_NAME                                   HDMI_TX1_P   /*!< Routed pin name */
#define PINCTRL_HDMI_P1_39_LABEL                                     "HDMI_TX1P"   /*!< Label */
#define PINCTRL_HDMI_P1_39_NAME                                          "P1_39"   /*!< Identifier */

/* HDMI_TX2_N (number AJ27), HDMI_TX2N */
/* Routed pin properties */
#define PINCTRL_HDMI_P1_47_PERIPHERAL                                       HDMI   /*!< Peripheral name */
#define PINCTRL_HDMI_P1_47_SIGNAL                                     hdmi_tx2_n   /*!< Signal name */
#define PINCTRL_HDMI_P1_47_PIN_NAME                                   HDMI_TX2_N   /*!< Routed pin name */
#define PINCTRL_HDMI_P1_47_LABEL                                     "HDMI_TX2N"   /*!< Label */
#define PINCTRL_HDMI_P1_47_NAME                                          "P1_47"   /*!< Identifier */

/* HDMI_TX2_P (number AH27), HDMI_TX2P */
/* Routed pin properties */
#define PINCTRL_HDMI_P1_45_PERIPHERAL                                       HDMI   /*!< Peripheral name */
#define PINCTRL_HDMI_P1_45_SIGNAL                                     hdmi_tx2_p   /*!< Signal name */
#define PINCTRL_HDMI_P1_45_PIN_NAME                                   HDMI_TX2_P   /*!< Routed pin name */
#define PINCTRL_HDMI_P1_45_LABEL                                     "HDMI_TX2P"   /*!< Label */
#define PINCTRL_HDMI_P1_45_NAME                                          "P1_45"   /*!< Identifier */

/* HDMI_TXC_N (number AJ24), HDMI_TXCN */
/* Routed pin properties */
#define PINCTRL_HDMI_P1_25_PERIPHERAL                                       HDMI   /*!< Peripheral name */
#define PINCTRL_HDMI_P1_25_SIGNAL                                     hdmi_txc_n   /*!< Signal name */
#define PINCTRL_HDMI_P1_25_PIN_NAME                                   HDMI_TXC_N   /*!< Routed pin name */
#define PINCTRL_HDMI_P1_25_LABEL                                     "HDMI_TXCN"   /*!< Label */
#define PINCTRL_HDMI_P1_25_NAME                                          "P1_25"   /*!< Identifier */

/* HDMI_TXC_P (number AH24), HDMI_TXCP */
/* Routed pin properties */
#define PINCTRL_HDMI_P1_23_PERIPHERAL                                       HDMI   /*!< Peripheral name */
#define PINCTRL_HDMI_P1_23_SIGNAL                                     hdmi_txc_p   /*!< Signal name */
#define PINCTRL_HDMI_P1_23_PIN_NAME                                   HDMI_TXC_P   /*!< Routed pin name */
#define PINCTRL_HDMI_P1_23_LABEL                                     "HDMI_TXCP"   /*!< Label */
#define PINCTRL_HDMI_P1_23_NAME                                          "P1_23"   /*!< Identifier */

/* HDMI_CEC (number AD22), HDMI_CEC */
/* Routed pin properties */
#define PINCTRL_HDMI_P1_85_PERIPHERAL                                       HDMI   /*!< Peripheral name */
#define PINCTRL_HDMI_P1_85_SIGNAL                                       hdmi_cec   /*!< Signal name */
#define PINCTRL_HDMI_P1_85_PIN_NAME                                     HDMI_CEC   /*!< Routed pin name */
#define PINCTRL_HDMI_P1_85_LABEL                                      "HDMI_CEC"   /*!< Label */
#define PINCTRL_HDMI_P1_85_NAME                                          "P1_85"   /*!< Identifier */

/* HDMI_DDC_SCL (number AC22), HDMI_DDC_SCL */
/* Routed pin properties */
#define PINCTRL_HDMI_P1_70_PERIPHERAL                                       HDMI   /*!< Peripheral name */
#define PINCTRL_HDMI_P1_70_SIGNAL                                       hdmi_scl   /*!< Signal name */
#define PINCTRL_HDMI_P1_70_PIN_NAME                                 HDMI_DDC_SCL   /*!< Routed pin name */
#define PINCTRL_HDMI_P1_70_LABEL                                  "HDMI_DDC_SCL"   /*!< Label */
#define PINCTRL_HDMI_P1_70_NAME                                          "P1_70"   /*!< Identifier */

/* HDMI_DDC_SDA (number AF22), HDMI_DDC_SDA */
/* Routed pin properties */
#define PINCTRL_HDMI_P1_63_PERIPHERAL                                       HDMI   /*!< Peripheral name */
#define PINCTRL_HDMI_P1_63_SIGNAL                                       hdmi_sda   /*!< Signal name */
#define PINCTRL_HDMI_P1_63_PIN_NAME                                 HDMI_DDC_SDA   /*!< Routed pin name */
#define PINCTRL_HDMI_P1_63_LABEL                                  "HDMI_DDC_SDA"   /*!< Label */
#define PINCTRL_HDMI_P1_63_NAME                                          "P1_63"   /*!< Identifier */

/* HDMI_HPD (number AE22), HDMI_HPD */
/* Routed pin properties */
#define PINCTRL_HDMI_P1_92_PERIPHERAL                                       HDMI   /*!< Peripheral name */
#define PINCTRL_HDMI_P1_92_SIGNAL                                       hdmi_hpd   /*!< Signal name */
#define PINCTRL_HDMI_P1_92_PIN_NAME                                     HDMI_HPD   /*!< Routed pin name */
#define PINCTRL_HDMI_P1_92_LABEL                                      "HDMI_HPD"   /*!< Label */
#define PINCTRL_HDMI_P1_92_NAME                                          "P1_92"   /*!< Identifier */

/* I2C1_SCL (number AC8), N/A */
/* Routed pin properties */
#define PINCTRL_I2C1_InternalPMIC_PERIPHERAL                               I2C1   /*!< Peripheral name */
#define PINCTRL_I2C1_InternalPMIC_SIGNAL                                i2c_scl   /*!< Signal name */
#define PINCTRL_I2C1_InternalPMIC_PIN_NAME                             I2C1_SCL   /*!< Routed pin name */
#define PINCTRL_I2C1_InternalPMIC_LABEL                                   "N/A"   /*!< Label */
#define PINCTRL_I2C1_InternalPMIC_NAME                          "Internal PMIC"   /*!< Identifier */

/* I2C2_SCL (number AH6), AUD_SDA */
/* Routed pin properties */
#define PINCTRL_I2C2_P1_99_PERIPHERAL                                       I2C2   /*!< Peripheral name */
#define PINCTRL_I2C2_P1_99_SIGNAL                                        i2c_scl   /*!< Signal name */
#define PINCTRL_I2C2_P1_99_PIN_NAME                                     I2C2_SCL   /*!< Routed pin name */
#define PINCTRL_I2C2_P1_99_LABEL                                       "AUD_SDA"   /*!< Label */
#define PINCTRL_I2C2_P1_99_NAME                                          "P1_99"   /*!< Identifier */

/* I2C2_SDA (number AE8), AUD_SDL */
/* Routed pin properties */
#define PINCTRL_I2C2_P1_97_PERIPHERAL                                       I2C2   /*!< Peripheral name */
#define PINCTRL_I2C2_P1_97_SIGNAL                                        i2c_sda   /*!< Signal name */
#define PINCTRL_I2C2_P1_97_PIN_NAME                                     I2C2_SDA   /*!< Routed pin name */
#define PINCTRL_I2C2_P1_97_LABEL                                       "AUD_SDL"   /*!< Label */
#define PINCTRL_I2C2_P1_97_NAME                                          "P1_97"   /*!< Identifier */

/* SAI5_RXD0 (number AE16), I2C5_SCL */
/* Routed pin properties */
#define PINCTRL_I2C5_P1_100_PERIPHERAL                                      I2C5   /*!< Peripheral name */
#define PINCTRL_I2C5_P1_100_SIGNAL                                       i2c_scl   /*!< Signal name */
#define PINCTRL_I2C5_P1_100_PIN_NAME                                   SAI5_RXD0   /*!< Routed pin name */
#define PINCTRL_I2C5_P1_100_LABEL                                     "I2C5_SCL"   /*!< Label */
#define PINCTRL_I2C5_P1_100_NAME                                        "P1_100"   /*!< Identifier */

