teleportboy/arm7_adc_imx8mp/board/pin_mux.h
/* SAI5_MCLK (number AF14), I2C5_SDA */
/* Routed pin properties */
#define PINCTRL_I2C5_P1_96_PERIPHERAL                                       I2C5   /*!< Peripheral name */
#define PINCTRL_I2C5_P1_96_SIGNAL                                        i2c_sda   /*!< Signal name */
#define PINCTRL_I2C5_P1_96_PIN_NAME                                    SAI5_MCLK   /*!< Routed pin name */
#define PINCTRL_I2C5_P1_96_LABEL                                      "I2C5_SDA"   /*!< Label */
#define PINCTRL_I2C5_P1_96_NAME                                          "P1_96"   /*!< Identifier */

/* LVDS0_CLK_N (coord G28), LVDS_CLK_N */
/* Routed pin properties */
#define PINCTRL_LVDS0_P1_82_PERIPHERAL                                     LVDS0   /*!< Peripheral name */
#define PINCTRL_LVDS0_P1_82_SIGNAL                                    lvds_clk_n   /*!< Signal name */
#define PINCTRL_LVDS0_P1_82_PIN_NAME                                 LVDS0_CLK_N   /*!< Routed pin name */
#define PINCTRL_LVDS0_P1_82_LABEL                                   "LVDS_CLK_N"   /*!< Label */
#define PINCTRL_LVDS0_P1_82_NAME                                         "P1_82"   /*!< Identifier */

/* LVDS0_CLK_P (coord F29), LVDS_CLK_P */
/* Routed pin properties */
#define PINCTRL_LVDS0_P1_80_PERIPHERAL                                     LVDS0   /*!< Peripheral name */
#define PINCTRL_LVDS0_P1_80_SIGNAL                                    lvds_clk_p   /*!< Signal name */
#define PINCTRL_LVDS0_P1_80_PIN_NAME                                 LVDS0_CLK_P   /*!< Routed pin name */
#define PINCTRL_LVDS0_P1_80_LABEL                                   "LVDS_CLK_P"   /*!< Label */
#define PINCTRL_LVDS0_P1_80_NAME                                         "P1_80"   /*!< Identifier */

/* LVDS0_D0_N (coord E28), LVDS_D0_N */
/* Routed pin properties */
#define PINCTRL_LVDS0_P1_44_PERIPHERAL                                     LVDS0   /*!< Peripheral name */
#define PINCTRL_LVDS0_P1_44_SIGNAL                                     lvds_d0_n   /*!< Signal name */
#define PINCTRL_LVDS0_P1_44_PIN_NAME                                  LVDS0_D0_N   /*!< Routed pin name */
#define PINCTRL_LVDS0_P1_44_LABEL                                    "LVDS_D0_N"   /*!< Label */
#define PINCTRL_LVDS0_P1_44_NAME                                         "P1_44"   /*!< Identifier */

/* LVDS0_D0_P (coord D29), LVDS_D0_P */
/* Routed pin properties */
#define PINCTRL_LVDS0_P1_42_PERIPHERAL                                     LVDS0   /*!< Peripheral name */
#define PINCTRL_LVDS0_P1_42_SIGNAL                                     lvds_d0_p   /*!< Signal name */
#define PINCTRL_LVDS0_P1_42_PIN_NAME                                  LVDS0_D0_P   /*!< Routed pin name */
#define PINCTRL_LVDS0_P1_42_LABEL                                    "LVDS_D0_P"   /*!< Label */
#define PINCTRL_LVDS0_P1_42_NAME                                         "P1_42"   /*!< Identifier */

/* LVDS0_D1_N (coord F28), LVDS_D1_N */
/* Routed pin properties */
#define PINCTRL_LVDS0_P1_48_PERIPHERAL                                     LVDS0   /*!< Peripheral name */
#define PINCTRL_LVDS0_P1_48_SIGNAL                                     lvds_d1_n   /*!< Signal name */
#define PINCTRL_LVDS0_P1_48_PIN_NAME                                  LVDS0_D1_N   /*!< Routed pin name */
#define PINCTRL_LVDS0_P1_48_LABEL                                    "LVDS_D1_N"   /*!< Label */
#define PINCTRL_LVDS0_P1_48_NAME                                         "P1_48"   /*!< Identifier */

/* LVDS0_D1_P (coord E29), LVDS_D1_P */
/* Routed pin properties */
#define PINCTRL_LVDS0_P1_46_PERIPHERAL                                     LVDS0   /*!< Peripheral name */
#define PINCTRL_LVDS0_P1_46_SIGNAL                                     lvds_d1_p   /*!< Signal name */
#define PINCTRL_LVDS0_P1_46_PIN_NAME                                  LVDS0_D1_P   /*!< Routed pin name */
#define PINCTRL_LVDS0_P1_46_LABEL                                    "LVDS_D1_P"   /*!< Label */
#define PINCTRL_LVDS0_P1_46_NAME                                         "P1_46"   /*!< Identifier */

/* LVDS0_D2_N (coord H28), LVDS_D2_N */
/* Routed pin properties */
#define PINCTRL_LVDS0_P1_52_PERIPHERAL                                     LVDS0   /*!< Peripheral name */
#define PINCTRL_LVDS0_P1_52_SIGNAL                                     lvds_d2_n   /*!< Signal name */
#define PINCTRL_LVDS0_P1_52_PIN_NAME                                  LVDS0_D2_N   /*!< Routed pin name */
#define PINCTRL_LVDS0_P1_52_LABEL                                    "LVDS_D2_N"   /*!< Label */
#define PINCTRL_LVDS0_P1_52_NAME                                         "P1_52"   /*!< Identifier */

/* LVDS0_D2_P (coord G29), LVDS_D2_P */
/* Routed pin properties */
#define PINCTRL_LVDS0_P1_50_PERIPHERAL                                     LVDS0   /*!< Peripheral name */
#define PINCTRL_LVDS0_P1_50_SIGNAL                                     lvds_d2_p   /*!< Signal name */
#define PINCTRL_LVDS0_P1_50_PIN_NAME                                  LVDS0_D2_P   /*!< Routed pin name */
#define PINCTRL_LVDS0_P1_50_LABEL                                    "LVDS_D2_P"   /*!< Label */
#define PINCTRL_LVDS0_P1_50_NAME                                         "P1_50"   /*!< Identifier */

/* LVDS0_D3_N (coord J28), LVDS_D3_N */
/* Routed pin properties */
#define PINCTRL_LVDS0_P1_58_PERIPHERAL                                     LVDS0   /*!< Peripheral name */
#define PINCTRL_LVDS0_P1_58_SIGNAL                                     lvds_d3_n   /*!< Signal name */
#define PINCTRL_LVDS0_P1_58_PIN_NAME                                  LVDS0_D3_N   /*!< Routed pin name */
#define PINCTRL_LVDS0_P1_58_LABEL                                    "LVDS_D3_N"   /*!< Label */
#define PINCTRL_LVDS0_P1_58_NAME                                         "P1_58"   /*!< Identifier */

/* LVDS0_D3_P (coord H29), LVDS_D3_P */
/* Routed pin properties */
#define PINCTRL_LVDS0_P1_56_PERIPHERAL                                     LVDS0   /*!< Peripheral name */
#define PINCTRL_LVDS0_P1_56_SIGNAL                                     lvds_d3_p   /*!< Signal name */
#define PINCTRL_LVDS0_P1_56_PIN_NAME                                  LVDS0_D3_P   /*!< Routed pin name */
#define PINCTRL_LVDS0_P1_56_LABEL                                    "LVDS_D3_P"   /*!< Label */
#define PINCTRL_LVDS0_P1_56_NAME                                         "P1_56"   /*!< Identifier */

/* SAI5_RXFS (number AC14), EN_LCD */
/* Routed pin properties */
#define PINCTRL_LVDS0_P1_87_PERIPHERAL                                     GPIO3   /*!< Peripheral name */
#define PINCTRL_LVDS0_P1_87_SIGNAL                                       gpio_io   /*!< Signal name */
#define PINCTRL_LVDS0_P1_87_CHANNEL                                           19   /*!< Signal channel */
#define PINCTRL_LVDS0_P1_87_PIN_NAME                                   SAI5_RXFS   /*!< Routed pin name */
#define PINCTRL_LVDS0_P1_87_LABEL                                       "EN_LCD"   /*!< Label */
#define PINCTRL_LVDS0_P1_87_NAME                                         "P1_87"   /*!< Identifier */
#define PINCTRL_LVDS0_P1_87_DIRECTION                        kGPIO_DigitalOutput   /*!< Direction */

