teleportboy/arm7_adc_imx8mp/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define PINCTRL_LVDS0_P1_87_GPIO                                           GPIO3   /*!< GPIO peripheral base pointer */
#define PINCTRL_LVDS0_P1_87_GPIO_PIN                                         19U   /*!< GPIO pin number */
#define PINCTRL_LVDS0_P1_87_GPIO_PIN_MASK                            (1U << 19U)   /*!< GPIO pin mask */

/* GPIO1_IO03 (coord D6), N/A */
/* Routed pin properties */
#define PINCTRL_PMIC_InternalPMIC_PERIPHERAL                              GPIO1   /*!< Peripheral name */
#define PINCTRL_PMIC_InternalPMIC_SIGNAL                                gpio_io   /*!< Signal name */
#define PINCTRL_PMIC_InternalPMIC_CHANNEL                                    03   /*!< Signal channel */
#define PINCTRL_PMIC_InternalPMIC_PIN_NAME                           GPIO1_IO03   /*!< Routed pin name */
#define PINCTRL_PMIC_InternalPMIC_LABEL                                   "N/A"   /*!< Label */
#define PINCTRL_PMIC_InternalPMIC_NAME                          "Internal PMIC"   /*!< Identifier */

/* Symbols to be used with GPIO driver */
#define PINCTRL_PMIC_InternalPMIC_GPIO                                    GPIO1   /*!< GPIO peripheral base pointer */
#define PINCTRL_PMIC_InternalPMIC_GPIO_PIN                                   3U   /*!< GPIO pin number */
#define PINCTRL_PMIC_InternalPMIC_GPIO_PIN_MASK                      (1U << 3U)   /*!< GPIO pin mask */

/* NAND_ALE (coord N25), N/A */
/* Routed pin properties */
#define PINCTRL_FLEXSPI0_OptionalQSPIFlash_PERIPHERAL                     QSPI   /*!< Peripheral name */
#define PINCTRL_FLEXSPI0_OptionalQSPIFlash_SIGNAL                  qspi_a_sclk   /*!< Signal name */
#define PINCTRL_FLEXSPI0_OptionalQSPIFlash_PIN_NAME                   NAND_ALE   /*!< Routed pin name */
#define PINCTRL_FLEXSPI0_OptionalQSPIFlash_LABEL                         "N/A"   /*!< Label */
#define PINCTRL_FLEXSPI0_OptionalQSPIFlash_NAME          "Optional QSPI Flash"   /*!< Identifier */

/* NAND_DQS (coord R26), N/A */
/* Routed pin properties */
#define PINCTRL_FLEXSPI0_NotroutedtoP1P2_PERIPHERAL                    QSPI   /*!< Peripheral name */
#define PINCTRL_FLEXSPI0_NotroutedtoP1P2_SIGNAL                  qspi_a_dqs   /*!< Signal name */
#define PINCTRL_FLEXSPI0_NotroutedtoP1P2_PIN_NAME                  NAND_DQS   /*!< Routed pin name */
#define PINCTRL_FLEXSPI0_NotroutedtoP1P2_LABEL                        "N/A"   /*!< Label */
#define PINCTRL_FLEXSPI0_NotroutedtoP1P2_NAME        "Not routed to P1, P2"   /*!< Identifier */

/* SAI3_TXC (number AH19), AUD_BCLK */
/* Routed pin properties */
#define PINCTRL_SAI3_AUDIO_P1_36_PERIPHERAL                                 SAI3   /*!< Peripheral name */
#define PINCTRL_SAI3_AUDIO_P1_36_SIGNAL                              sai_tx_bclk   /*!< Signal name */
#define PINCTRL_SAI3_AUDIO_P1_36_PIN_NAME                               SAI3_TXC   /*!< Routed pin name */
#define PINCTRL_SAI3_AUDIO_P1_36_LABEL                                "AUD_BCLK"   /*!< Label */
#define PINCTRL_SAI3_AUDIO_P1_36_NAME                                    "P1_36"   /*!< Identifier */

/* SAI3_TXD (number AH18), AUD_DIN */
/* Routed pin properties */
#define PINCTRL_SAI3_AUDIO_P1_26_PERIPHERAL                                 SAI3   /*!< Peripheral name */
#define PINCTRL_SAI3_AUDIO_P1_26_SIGNAL                              sai_tx_data   /*!< Signal name */
#define PINCTRL_SAI3_AUDIO_P1_26_CHANNEL                                       0   /*!< Signal channel */
#define PINCTRL_SAI3_AUDIO_P1_26_PIN_NAME                               SAI3_TXD   /*!< Routed pin name */
#define PINCTRL_SAI3_AUDIO_P1_26_LABEL                                 "AUD_DIN"   /*!< Label */
#define PINCTRL_SAI3_AUDIO_P1_26_NAME                                    "P1_26"   /*!< Identifier */

/* SAI3_MCLK (number AJ20), AUD_MCLK */
/* Routed pin properties */
#define PINCTRL_SAI3_AUDIO_P1_30_PERIPHERAL                                 SAI3   /*!< Peripheral name */
#define PINCTRL_SAI3_AUDIO_P1_30_SIGNAL                                 sai_mclk   /*!< Signal name */
#define PINCTRL_SAI3_AUDIO_P1_30_PIN_NAME                              SAI3_MCLK   /*!< Routed pin name */
#define PINCTRL_SAI3_AUDIO_P1_30_LABEL                                "AUD_MCLK"   /*!< Label */
#define PINCTRL_SAI3_AUDIO_P1_30_NAME                                    "P1_30"   /*!< Identifier */

/* SAI3_TXFS (number AC16), AUD_TXFS */
/* Routed pin properties */
#define PINCTRL_SAI3_AUDIO_P1_38_PERIPHERAL                                 SAI3   /*!< Peripheral name */
#define PINCTRL_SAI3_AUDIO_P1_38_SIGNAL                              sai_tx_sync   /*!< Signal name */
#define PINCTRL_SAI3_AUDIO_P1_38_PIN_NAME                              SAI3_TXFS   /*!< Routed pin name */
#define PINCTRL_SAI3_AUDIO_P1_38_LABEL                                "AUD_TXFS"   /*!< Label */
#define PINCTRL_SAI3_AUDIO_P1_38_NAME                                    "P1_38"   /*!< Identifier */

/* SAI3_RXC (number AJ18), MIC_CLK */
/* Routed pin properties */
#define PINCTRL_SAI5_MIC_P1_32_PERIPHERAL                                    PDM   /*!< Peripheral name */
#define PINCTRL_SAI5_MIC_P1_32_SIGNAL                                    pdm_clk   /*!< Signal name */
#define PINCTRL_SAI5_MIC_P1_32_PIN_NAME                                 SAI3_RXC   /*!< Routed pin name */
#define PINCTRL_SAI5_MIC_P1_32_LABEL                                   "MIC_CLK"   /*!< Label */
#define PINCTRL_SAI5_MIC_P1_32_NAME                                      "P1_32"   /*!< Identifier */

/* SAI3_RXFS (number AJ19), MIC_DATA */
/* Routed pin properties */
#define PINCTRL_SAI5_MIC_P1_34_PERIPHERAL                                    PDM   /*!< Peripheral name */
#define PINCTRL_SAI5_MIC_P1_34_SIGNAL                             pdm_bit_stream   /*!< Signal name */
#define PINCTRL_SAI5_MIC_P1_34_CHANNEL                                         0   /*!< Signal channel */
#define PINCTRL_SAI5_MIC_P1_34_PIN_NAME                                SAI3_RXFS   /*!< Routed pin name */
#define PINCTRL_SAI5_MIC_P1_34_LABEL                                  "MIC_DATA"   /*!< Label */
#define PINCTRL_SAI5_MIC_P1_34_NAME                                      "P1_34"   /*!< Identifier */

/* ONOFF (coord G22), PWR_SW */
/* Routed pin properties */
#define PINCTRL_SNVS_P2_64_PERIPHERAL                                       SNVS   /*!< Peripheral name */
#define PINCTRL_SNVS_P2_64_SIGNAL                                     snvs_onoff   /*!< Signal name */
#define PINCTRL_SNVS_P2_64_PIN_NAME                                        ONOFF   /*!< Routed pin name */
#define PINCTRL_SNVS_P2_64_LABEL                                        "PWR_SW"   /*!< Label */
#define PINCTRL_SNVS_P2_64_NAME                                          "P2_64"   /*!< Identifier */

/* PMIC_ON_REQ (coord F22), PMIC_STBY_R */
/* Routed pin properties */
#define PINCTRL_SNVS_P1_68_PERIPHERAL                                       SNVS   /*!< Peripheral name */
#define PINCTRL_SNVS_P1_68_SIGNAL                               snvs_pmic_on_req   /*!< Signal name */
#define PINCTRL_SNVS_P1_68_PIN_NAME                                  PMIC_ON_REQ   /*!< Routed pin name */
#define PINCTRL_SNVS_P1_68_LABEL                                   "PMIC_STBY_R"   /*!< Label */
#define PINCTRL_SNVS_P1_68_NAME                                          "P1_68"   /*!< Identifier */

/* POR_B (coord J29), POR_B */
/* Routed pin properties */
#define PINCTRL_SNVS_P2_66_PERIPHERAL                                       SNVS   /*!< Peripheral name */
#define PINCTRL_SNVS_P2_66_SIGNAL                                     snvs_por_b   /*!< Signal name */
#define PINCTRL_SNVS_P2_66_PIN_NAME                                        POR_B   /*!< Routed pin name */
#define PINCTRL_SNVS_P2_66_LABEL                                         "POR_B"   /*!< Label */
#define PINCTRL_SNVS_P2_66_NAME                                          "P2_66"   /*!< Identifier */

