teleportboy/arm7_adc_imx8mp/board/pin_mux.h
/* RTC_XTALI (coord J25), N/A */
/* Routed pin properties */
#define PINCTRL_SNVS_NotroutedtoP1P2_PERIPHERAL                        SNVS   /*!< Peripheral name */
#define PINCTRL_SNVS_NotroutedtoP1P2_SIGNAL                        snvs_rtc   /*!< Signal name */
#define PINCTRL_SNVS_NotroutedtoP1P2_PIN_NAME                     RTC_XTALI   /*!< Routed pin name */
#define PINCTRL_SNVS_NotroutedtoP1P2_LABEL                            "N/A"   /*!< Label */
#define PINCTRL_SNVS_NotroutedtoP1P2_NAME            "Not routed to P1, P2"   /*!< Identifier */

/* GPIO1_IO02 (coord B6), N/A */
/* Routed pin properties */
#define PINCTRL_WDOG_InternalWatchdog_PERIPHERAL                          WDOG1   /*!< Peripheral name */
#define PINCTRL_WDOG_InternalWatchdog_SIGNAL                        wdog_wdog_b   /*!< Signal name */
#define PINCTRL_WDOG_InternalWatchdog_PIN_NAME                       GPIO1_IO02   /*!< Routed pin name */
#define PINCTRL_WDOG_InternalWatchdog_LABEL                               "N/A"   /*!< Label */
#define PINCTRL_WDOG_InternalWatchdog_NAME                  "Internal Watchdog"   /*!< Identifier */

/* SAI2_RXC (number AJ16), UART1_RX */
/* Routed pin properties */
#define PINCTRL_UART1_485_P1_53_PERIPHERAL                                 UART1   /*!< Peripheral name */
#define PINCTRL_UART1_485_P1_53_SIGNAL                                   uart_rx   /*!< Signal name */
#define PINCTRL_UART1_485_P1_53_PIN_NAME                                SAI2_RXC   /*!< Routed pin name */
#define PINCTRL_UART1_485_P1_53_LABEL                                 "UART1_RX"   /*!< Label */
#define PINCTRL_UART1_485_P1_53_NAME                                     "P1_53"   /*!< Identifier */

/* UART1_TXD (number AJ3), UART1_TX */
/* Routed pin properties */
#define PINCTRL_UART1_485_P1_72_PERIPHERAL                                 UART1   /*!< Peripheral name */
#define PINCTRL_UART1_485_P1_72_SIGNAL                                   uart_tx   /*!< Signal name */
#define PINCTRL_UART1_485_P1_72_PIN_NAME                               UART1_TXD   /*!< Routed pin name */
#define PINCTRL_UART1_485_P1_72_LABEL                                 "UART1_TX"   /*!< Label */
#define PINCTRL_UART1_485_P1_72_NAME                                     "P1_72"   /*!< Identifier */

/* SAI2_TXFS (number AJ17), 485_DE_1 */
/* Routed pin properties */
#define PINCTRL_UART1_485_P2_76_PERIPHERAL                                 UART1   /*!< Peripheral name */
#define PINCTRL_UART1_485_P2_76_SIGNAL                                uart_rts_b   /*!< Signal name */
#define PINCTRL_UART1_485_P2_76_PIN_NAME                               SAI2_TXFS   /*!< Routed pin name */
#define PINCTRL_UART1_485_P2_76_LABEL                                 "485_DE_1"   /*!< Label */
#define PINCTRL_UART1_485_P2_76_NAME                                     "P2_76"   /*!< Identifier */

/* UART2_RXD (number AF6), UART2_RX */
/* Routed pin properties */
#define PINCTRL_UART2_GNSS1_P1_76_PERIPHERAL                               UART2   /*!< Peripheral name */
#define PINCTRL_UART2_GNSS1_P1_76_SIGNAL                                 uart_rx   /*!< Signal name */
#define PINCTRL_UART2_GNSS1_P1_76_PIN_NAME                             UART2_RXD   /*!< Routed pin name */
#define PINCTRL_UART2_GNSS1_P1_76_LABEL                               "UART2_RX"   /*!< Label */
#define PINCTRL_UART2_GNSS1_P1_76_NAME                                   "P1_76"   /*!< Identifier */

/* UART2_TXD (number AH4), UART2_TX */
/* Routed pin properties */
#define PINCTRL_UART2_GNSS1_P1_74_PERIPHERAL                               UART2   /*!< Peripheral name */
#define PINCTRL_UART2_GNSS1_P1_74_SIGNAL                                 uart_tx   /*!< Signal name */
#define PINCTRL_UART2_GNSS1_P1_74_PIN_NAME                             UART2_TXD   /*!< Routed pin name */
#define PINCTRL_UART2_GNSS1_P1_74_LABEL                               "UART2_TX"   /*!< Label */
#define PINCTRL_UART2_GNSS1_P1_74_NAME                                   "P1_74"   /*!< Identifier */

/* UART3_RXD (number AE6), UART3_RX */
/* Routed pin properties */
#define PINCTRL_UART3_GNSS2_P1_21_PERIPHERAL                               UART3   /*!< Peripheral name */
#define PINCTRL_UART3_GNSS2_P1_21_SIGNAL                                 uart_rx   /*!< Signal name */
#define PINCTRL_UART3_GNSS2_P1_21_PIN_NAME                             UART3_RXD   /*!< Routed pin name */
#define PINCTRL_UART3_GNSS2_P1_21_LABEL                               "UART3_RX"   /*!< Label */
#define PINCTRL_UART3_GNSS2_P1_21_NAME                                   "P1_21"   /*!< Identifier */

/* UART3_TXD (number AJ4), UART3_TX */
/* Routed pin properties */
#define PINCTRL_UART3_GNSS2_P1_61_PERIPHERAL                               UART3   /*!< Peripheral name */
#define PINCTRL_UART3_GNSS2_P1_61_SIGNAL                                 uart_tx   /*!< Signal name */
#define PINCTRL_UART3_GNSS2_P1_61_PIN_NAME                             UART3_TXD   /*!< Routed pin name */
#define PINCTRL_UART3_GNSS2_P1_61_LABEL                               "UART3_TX"   /*!< Label */
#define PINCTRL_UART3_GNSS2_P1_61_NAME                                   "P1_61"   /*!< Identifier */

/* ECSPI2_SCLK (number AH21), UART4_RX */
/* Routed pin properties */
#define PINCTRL_UART4_485_P2_93_PERIPHERAL                                 UART4   /*!< Peripheral name */
#define PINCTRL_UART4_485_P2_93_SIGNAL                                   uart_rx   /*!< Signal name */
#define PINCTRL_UART4_485_P2_93_PIN_NAME                             ECSPI2_SCLK   /*!< Routed pin name */
#define PINCTRL_UART4_485_P2_93_LABEL                                 "UART4_RX"   /*!< Label */
#define PINCTRL_UART4_485_P2_93_NAME                                     "P2_93"   /*!< Identifier */

/* ECSPI2_MOSI (number AJ21), UART4_TX */
/* Routed pin properties */
#define PINCTRL_UART4_485_P2_95_PERIPHERAL                                 UART4   /*!< Peripheral name */
#define PINCTRL_UART4_485_P2_95_SIGNAL                                   uart_tx   /*!< Signal name */
#define PINCTRL_UART4_485_P2_95_PIN_NAME                             ECSPI2_MOSI   /*!< Routed pin name */
#define PINCTRL_UART4_485_P2_95_LABEL                                 "UART4_TX"   /*!< Label */
#define PINCTRL_UART4_485_P2_95_NAME                                     "P2_95"   /*!< Identifier */

/* ECSPI2_MISO (number AH20), 485_DE_2 */
/* Routed pin properties */
#define PINCTRL_UART4_485_P2_89_PERIPHERAL                                 UART4   /*!< Peripheral name */
#define PINCTRL_UART4_485_P2_89_SIGNAL                                uart_rts_b   /*!< Signal name */
#define PINCTRL_UART4_485_P2_89_PIN_NAME                             ECSPI2_MISO   /*!< Routed pin name */
#define PINCTRL_UART4_485_P2_89_LABEL                                 "485_DE_2"   /*!< Label */
#define PINCTRL_UART4_485_P2_89_NAME                                     "P2_89"   /*!< Identifier */

