teleportboy/arm7_adc_imx8mp/board/pin_mux.h
/* GPIO1_IO14 (coord A4), N/A */
/* Routed pin properties */
#define PINCTRL_USB1_VBUS_InternalMisc_PERIPHERAL                         GPIO1   /*!< Peripheral name */
#define PINCTRL_USB1_VBUS_InternalMisc_SIGNAL                           gpio_io   /*!< Signal name */
#define PINCTRL_USB1_VBUS_InternalMisc_CHANNEL                               14   /*!< Signal channel */
#define PINCTRL_USB1_VBUS_InternalMisc_PIN_NAME                      GPIO1_IO14   /*!< Routed pin name */
#define PINCTRL_USB1_VBUS_InternalMisc_LABEL                              "N/A"   /*!< Label */
#define PINCTRL_USB1_VBUS_InternalMisc_NAME                     "Internal Misc"   /*!< Identifier */

/* Symbols to be used with GPIO driver */
#define PINCTRL_USB1_VBUS_InternalMisc_GPIO                               GPIO1   /*!< GPIO peripheral base pointer */
#define PINCTRL_USB1_VBUS_InternalMisc_GPIO_PIN                             14U   /*!< GPIO pin number */
#define PINCTRL_USB1_VBUS_InternalMisc_GPIO_PIN_MASK                (1U << 14U)   /*!< GPIO pin mask */

/* SD2_CLK (number AB29), SD_CLK */
/* Routed pin properties */
#define PINCTRL_USDHC2_P2_96_PERIPHERAL                                   USDHC2   /*!< Peripheral name */
#define PINCTRL_USDHC2_P2_96_SIGNAL                                    usdhc_clk   /*!< Signal name */
#define PINCTRL_USDHC2_P2_96_PIN_NAME                                    SD2_CLK   /*!< Routed pin name */
#define PINCTRL_USDHC2_P2_96_LABEL                                      "SD_CLK"   /*!< Label */
#define PINCTRL_USDHC2_P2_96_NAME                                        "P2_96"   /*!< Identifier */

/* SD2_CMD (number AB28), SD_CMD */
/* Routed pin properties */
#define PINCTRL_USDHC2_P2_100_PERIPHERAL                                  USDHC2   /*!< Peripheral name */
#define PINCTRL_USDHC2_P2_100_SIGNAL                                   usdhc_cmd   /*!< Signal name */
#define PINCTRL_USDHC2_P2_100_PIN_NAME                                   SD2_CMD   /*!< Routed pin name */
#define PINCTRL_USDHC2_P2_100_LABEL                                     "SD_CMD"   /*!< Label */
#define PINCTRL_USDHC2_P2_100_NAME                                      "P2_100"   /*!< Identifier */

/* SD2_DATA0 (number AC28), SD_DAT0 */
/* Routed pin properties */
#define PINCTRL_USDHC2_P2_97_PERIPHERAL                                   USDHC2   /*!< Peripheral name */
#define PINCTRL_USDHC2_P2_97_SIGNAL                                   usdhc_data   /*!< Signal name */
#define PINCTRL_USDHC2_P2_97_CHANNEL                                           0   /*!< Signal channel */
#define PINCTRL_USDHC2_P2_97_PIN_NAME                                  SD2_DATA0   /*!< Routed pin name */
#define PINCTRL_USDHC2_P2_97_LABEL                                     "SD_DAT0"   /*!< Label */
#define PINCTRL_USDHC2_P2_97_NAME                                        "P2_97"   /*!< Identifier */

/* SD2_DATA1 (number AC29), SD_DAT1 */
/* Routed pin properties */
#define PINCTRL_USDHC2_P2_99_PERIPHERAL                                   USDHC2   /*!< Peripheral name */
#define PINCTRL_USDHC2_P2_99_SIGNAL                                   usdhc_data   /*!< Signal name */
#define PINCTRL_USDHC2_P2_99_CHANNEL                                           1   /*!< Signal channel */
#define PINCTRL_USDHC2_P2_99_PIN_NAME                                  SD2_DATA1   /*!< Routed pin name */
#define PINCTRL_USDHC2_P2_99_LABEL                                     "SD_DAT1"   /*!< Label */
#define PINCTRL_USDHC2_P2_99_NAME                                        "P2_99"   /*!< Identifier */

/* SD2_DATA2 (number AA26), SD_DAT2 */
/* Routed pin properties */
#define PINCTRL_USDHC2_P2_94_PERIPHERAL                                   USDHC2   /*!< Peripheral name */
#define PINCTRL_USDHC2_P2_94_SIGNAL                                   usdhc_data   /*!< Signal name */
#define PINCTRL_USDHC2_P2_94_CHANNEL                                           2   /*!< Signal channel */
#define PINCTRL_USDHC2_P2_94_PIN_NAME                                  SD2_DATA2   /*!< Routed pin name */
#define PINCTRL_USDHC2_P2_94_LABEL                                     "SD_DAT2"   /*!< Label */
#define PINCTRL_USDHC2_P2_94_NAME                                        "P2_94"   /*!< Identifier */

/* SD2_DATA3 (number AA25), SD_DAT3 */
/* Routed pin properties */
#define PINCTRL_USDHC2_P2_98_PERIPHERAL                                   USDHC2   /*!< Peripheral name */
#define PINCTRL_USDHC2_P2_98_SIGNAL                                   usdhc_data   /*!< Signal name */
#define PINCTRL_USDHC2_P2_98_CHANNEL                                           3   /*!< Signal channel */
#define PINCTRL_USDHC2_P2_98_PIN_NAME                                  SD2_DATA3   /*!< Routed pin name */
#define PINCTRL_USDHC2_P2_98_LABEL                                     "SD_DAT3"   /*!< Label */
#define PINCTRL_USDHC2_P2_98_NAME                                        "P2_98"   /*!< Identifier */

/* SD2_RESET_B (number AD28), SD_POW */
/* Routed pin properties */
#define PINCTRL_USDHC2_P2_51_PERIPHERAL                                   USDHC2   /*!< Peripheral name */
#define PINCTRL_USDHC2_P2_51_SIGNAL                                usdhc_reset_b   /*!< Signal name */
#define PINCTRL_USDHC2_P2_51_PIN_NAME                                SD2_RESET_B   /*!< Routed pin name */
#define PINCTRL_USDHC2_P2_51_LABEL                                      "SD_POW"   /*!< Label */
#define PINCTRL_USDHC2_P2_51_NAME                                        "P2_51"   /*!< Identifier */

/* NAND_CE1_B (coord T29), N/A */
/* Routed pin properties */
#define PINCTRL_USDHC3_InternaleMMC_PERIPHERAL                           USDHC3   /*!< Peripheral name */
#define PINCTRL_USDHC3_InternaleMMC_SIGNAL                         usdhc_strobe   /*!< Signal name */
#define PINCTRL_USDHC3_InternaleMMC_PIN_NAME                         NAND_CE1_B   /*!< Routed pin name */
#define PINCTRL_USDHC3_InternaleMMC_LABEL                                 "N/A"   /*!< Label */
#define PINCTRL_USDHC3_InternaleMMC_NAME                        "Internal eMMC"   /*!< Identifier */

/* USB1_D_N (coord E10), USB1_D- */
/* Routed pin properties */
#define PINCTRL_USB1_P1_14_PERIPHERAL                                       USB1   /*!< Peripheral name */
#define PINCTRL_USB1_P1_14_SIGNAL                                        usb_d_n   /*!< Signal name */
#define PINCTRL_USB1_P1_14_PIN_NAME                                     USB1_D_N   /*!< Routed pin name */
#define PINCTRL_USB1_P1_14_LABEL                                       "USB1_D-"   /*!< Label */
#define PINCTRL_USB1_P1_14_NAME                                          "P1_14"   /*!< Identifier */

