teleportboy/arm7_adc_imx8mp/board/pin_mux.h
/* USB1_D_P (coord D10), USB1_D+ */
/* Routed pin properties */
#define PINCTRL_USB1_P1_12_PERIPHERAL                                       USB1   /*!< Peripheral name */
#define PINCTRL_USB1_P1_12_SIGNAL                                        usb_d_p   /*!< Signal name */
#define PINCTRL_USB1_P1_12_PIN_NAME                                     USB1_D_P   /*!< Routed pin name */
#define PINCTRL_USB1_P1_12_LABEL                                       "USB1_D+"   /*!< Label */
#define PINCTRL_USB1_P1_12_NAME                                          "P1_12"   /*!< Identifier */

/* USB1_VBUS (coord A11), USB1_PWR */
/* Routed pin properties */
#define PINCTRL_USB1_P1_24_PERIPHERAL                                       USB1   /*!< Peripheral name */
#define PINCTRL_USB1_P1_24_SIGNAL                                       usb_vbus   /*!< Signal name */
#define PINCTRL_USB1_P1_24_PIN_NAME                                    USB1_VBUS   /*!< Routed pin name */
#define PINCTRL_USB1_P1_24_LABEL                                      "USB1_PWR"   /*!< Label */
#define PINCTRL_USB1_P1_24_NAME                                          "P1_24"   /*!< Identifier */

/* GPIO1_IO00 (coord A7), USB1_DRV */
/* Routed pin properties */
#define PINCTRL_USB1_P1_59_PERIPHERAL                                      GPIO1   /*!< Peripheral name */
#define PINCTRL_USB1_P1_59_SIGNAL                                        gpio_io   /*!< Signal name */
#define PINCTRL_USB1_P1_59_CHANNEL                                            00   /*!< Signal channel */
#define PINCTRL_USB1_P1_59_PIN_NAME                                   GPIO1_IO00   /*!< Routed pin name */
#define PINCTRL_USB1_P1_59_LABEL                                      "USB1_DRV"   /*!< Label */
#define PINCTRL_USB1_P1_59_NAME                                          "P1_59"   /*!< Identifier */
#define PINCTRL_USB1_P1_59_DIRECTION                         kGPIO_DigitalOutput   /*!< Direction */

/* Symbols to be used with GPIO driver */
#define PINCTRL_USB1_P1_59_GPIO                                            GPIO1   /*!< GPIO peripheral base pointer */
#define PINCTRL_USB1_P1_59_GPIO_PIN                                           0U   /*!< GPIO pin number */
#define PINCTRL_USB1_P1_59_GPIO_PIN_MASK                              (1U << 0U)   /*!< GPIO pin mask */

/* USB2_D_N (coord E14), USB2_D_N */
/* Routed pin properties */
#define PINCTRL_USB2_P1_05_PERIPHERAL                                       USB2   /*!< Peripheral name */
#define PINCTRL_USB2_P1_05_SIGNAL                                        usb_d_n   /*!< Signal name */
#define PINCTRL_USB2_P1_05_PIN_NAME                                     USB2_D_N   /*!< Routed pin name */
#define PINCTRL_USB2_P1_05_LABEL                                      "USB2_D_N"   /*!< Label */
#define PINCTRL_USB2_P1_05_NAME                                          "P1_05"   /*!< Identifier */

/* USB2_D_P (coord D14), USB2_D_P */
/* Routed pin properties */
#define PINCTRL_USB2_P1_03_PERIPHERAL                                       USB2   /*!< Peripheral name */
#define PINCTRL_USB2_P1_03_SIGNAL                                        usb_d_p   /*!< Signal name */
#define PINCTRL_USB2_P1_03_PIN_NAME                                     USB2_D_P   /*!< Routed pin name */
#define PINCTRL_USB2_P1_03_LABEL                                      "USB2_D_P"   /*!< Label */
#define PINCTRL_USB2_P1_03_NAME                                          "P1_03"   /*!< Identifier */

/* USB2_RX_N (coord B12), USB2_RX_N */
/* Routed pin properties */
#define PINCTRL_USB2_P1_09_PERIPHERAL                                       USB2   /*!< Peripheral name */
#define PINCTRL_USB2_P1_09_SIGNAL                                       usb_rx_n   /*!< Signal name */
#define PINCTRL_USB2_P1_09_PIN_NAME                                    USB2_RX_N   /*!< Routed pin name */
#define PINCTRL_USB2_P1_09_LABEL                                     "USB2_RX_N"   /*!< Label */
#define PINCTRL_USB2_P1_09_NAME                                          "P1_09"   /*!< Identifier */

/* USB2_RX_P (coord A12), USB2_RX_P */
/* Routed pin properties */
#define PINCTRL_USB2_P1_07_PERIPHERAL                                       USB2   /*!< Peripheral name */
#define PINCTRL_USB2_P1_07_SIGNAL                                       usb_rx_p   /*!< Signal name */
#define PINCTRL_USB2_P1_07_PIN_NAME                                    USB2_RX_P   /*!< Routed pin name */
#define PINCTRL_USB2_P1_07_LABEL                                     "USB2_RX_P"   /*!< Label */
#define PINCTRL_USB2_P1_07_NAME                                          "P1_07"   /*!< Identifier */

/* USB2_TX_P (coord A13), USB2_TX_P */
/* Routed pin properties */
#define PINCTRL_USB2_P1_13_PERIPHERAL                                       USB2   /*!< Peripheral name */
#define PINCTRL_USB2_P1_13_SIGNAL                                       usb_tx_p   /*!< Signal name */
#define PINCTRL_USB2_P1_13_PIN_NAME                                    USB2_TX_P   /*!< Routed pin name */
#define PINCTRL_USB2_P1_13_LABEL                                     "USB2_TX_P"   /*!< Label */
#define PINCTRL_USB2_P1_13_NAME                                          "P1_13"   /*!< Identifier */

/* USB2_TX_N (coord B13), USB2_TX_N */
/* Routed pin properties */
#define PINCTRL_USB2_P1_15_PERIPHERAL                                       USB2   /*!< Peripheral name */
#define PINCTRL_USB2_P1_15_SIGNAL                                       usb_tx_n   /*!< Signal name */
#define PINCTRL_USB2_P1_15_PIN_NAME                                    USB2_TX_N   /*!< Routed pin name */
#define PINCTRL_USB2_P1_15_LABEL                                     "USB2_TX_N"   /*!< Label */
#define PINCTRL_USB2_P1_15_NAME                                          "P1_15"   /*!< Identifier */

/* UART1_RXD (number AD6), USB2_DRV */
/* Routed pin properties */
#define PINCTRL_USB2_P1_19_PERIPHERAL                                      GPIO5   /*!< Peripheral name */
#define PINCTRL_USB2_P1_19_SIGNAL                                        gpio_io   /*!< Signal name */
#define PINCTRL_USB2_P1_19_CHANNEL                                            22   /*!< Signal channel */
#define PINCTRL_USB2_P1_19_PIN_NAME                                    UART1_RXD   /*!< Routed pin name */
#define PINCTRL_USB2_P1_19_LABEL                                      "USB2_DRV"   /*!< Label */
#define PINCTRL_USB2_P1_19_NAME                                          "P1_19"   /*!< Identifier */
#define PINCTRL_USB2_P1_19_DIRECTION                          kGPIO_DigitalInput   /*!< Direction */

