teleportboy/arm7_adc_imx8mp/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define PINCTRL_USB2_P1_19_GPIO                                            GPIO5   /*!< GPIO peripheral base pointer */
#define PINCTRL_USB2_P1_19_GPIO_PIN                                          22U   /*!< GPIO pin number */
#define PINCTRL_USB2_P1_19_GPIO_PIN_MASK                             (1U << 22U)   /*!< GPIO pin mask */

/* SPDIF_RX (number AD18), USB2_OVC */
/* Routed pin properties */
#define PINCTRL_USB2_P1_79_PERIPHERAL                                      GPIO5   /*!< Peripheral name */
#define PINCTRL_USB2_P1_79_SIGNAL                                        gpio_io   /*!< Signal name */
#define PINCTRL_USB2_P1_79_CHANNEL                                            04   /*!< Signal channel */
#define PINCTRL_USB2_P1_79_PIN_NAME                                     SPDIF_RX   /*!< Routed pin name */
#define PINCTRL_USB2_P1_79_LABEL                                      "USB2_OVC"   /*!< Label */
#define PINCTRL_USB2_P1_79_NAME                                          "P1_79"   /*!< Identifier */
#define PINCTRL_USB2_P1_79_DIRECTION                          kGPIO_DigitalInput   /*!< Direction */

/* Symbols to be used with GPIO driver */
#define PINCTRL_USB2_P1_79_GPIO                                            GPIO5   /*!< GPIO peripheral base pointer */
#define PINCTRL_USB2_P1_79_GPIO_PIN                                           4U   /*!< GPIO pin number */
#define PINCTRL_USB2_P1_79_GPIO_PIN_MASK                              (1U << 4U)   /*!< GPIO pin mask */

/* USB2_VBUS (coord D12), USB2_VBUS */
/* Routed pin properties */
#define PINCTRL_USB2_P1_01_PERIPHERAL                                       USB2   /*!< Peripheral name */
#define PINCTRL_USB2_P1_01_SIGNAL                                       usb_vbus   /*!< Signal name */
#define PINCTRL_USB2_P1_01_PIN_NAME                                    USB2_VBUS   /*!< Routed pin name */
#define PINCTRL_USB2_P1_01_LABEL                                     "USB2_VBUS"   /*!< Label */
#define PINCTRL_USB2_P1_01_NAME                                          "P1_01"   /*!< Identifier */

/* GPIO1_IO01 (coord E8), BAT_INT */
/* Routed pin properties */
#define PINCTRL_BAT_IC_P1_98_PERIPHERAL                                    GPIO1   /*!< Peripheral name */
#define PINCTRL_BAT_IC_P1_98_SIGNAL                                      gpio_io   /*!< Signal name */
#define PINCTRL_BAT_IC_P1_98_CHANNEL                                          01   /*!< Signal channel */
#define PINCTRL_BAT_IC_P1_98_PIN_NAME                                 GPIO1_IO01   /*!< Routed pin name */
#define PINCTRL_BAT_IC_P1_98_LABEL                                     "BAT_INT"   /*!< Label */
#define PINCTRL_BAT_IC_P1_98_NAME                                        "P1_98"   /*!< Identifier */
#define PINCTRL_BAT_IC_P1_98_DIRECTION                        kGPIO_DigitalInput   /*!< Direction */

/* Symbols to be used with GPIO driver */
#define PINCTRL_BAT_IC_P1_98_GPIO                                          GPIO1   /*!< GPIO peripheral base pointer */
#define PINCTRL_BAT_IC_P1_98_GPIO_PIN                                         1U   /*!< GPIO pin number */
#define PINCTRL_BAT_IC_P1_98_GPIO_PIN_MASK                            (1U << 1U)   /*!< GPIO pin mask */

/* SD1_RESET_B (coord W25), BAT_CE */
/* Routed pin properties */
#define PINCTRL_BAT_IC_P2_62_PERIPHERAL                                    GPIO2   /*!< Peripheral name */
#define PINCTRL_BAT_IC_P2_62_SIGNAL                                      gpio_io   /*!< Signal name */
#define PINCTRL_BAT_IC_P2_62_CHANNEL                                          10   /*!< Signal channel */
#define PINCTRL_BAT_IC_P2_62_PIN_NAME                                SD1_RESET_B   /*!< Routed pin name */
#define PINCTRL_BAT_IC_P2_62_LABEL                                      "BAT_CE"   /*!< Label */
#define PINCTRL_BAT_IC_P2_62_NAME                                        "P2_62"   /*!< Identifier */
#define PINCTRL_BAT_IC_P2_62_DIRECTION                       kGPIO_DigitalOutput   /*!< Direction */

/* Symbols to be used with GPIO driver */
#define PINCTRL_BAT_IC_P2_62_GPIO                                          GPIO2   /*!< GPIO peripheral base pointer */
#define PINCTRL_BAT_IC_P2_62_GPIO_PIN                                        10U   /*!< GPIO pin number */
#define PINCTRL_BAT_IC_P2_62_GPIO_PIN_MASK                           (1U << 10U)   /*!< GPIO pin mask */

/* UART4_RXD (number AJ5), BAT_SCL */
/* Routed pin properties */
#define PINCTRL_BAT_IC_P1_84_PERIPHERAL                                     I2C6   /*!< Peripheral name */
#define PINCTRL_BAT_IC_P1_84_SIGNAL                                      i2c_scl   /*!< Signal name */
#define PINCTRL_BAT_IC_P1_84_PIN_NAME                                  UART4_RXD   /*!< Routed pin name */
#define PINCTRL_BAT_IC_P1_84_LABEL                                     "BAT_SCL"   /*!< Label */
#define PINCTRL_BAT_IC_P1_84_NAME                                        "P1_84"   /*!< Identifier */

/* UART4_TXD (number AH5), BAT_SDA */
/* Routed pin properties */
#define PINCTRL_BAT_IC_P1_86_PERIPHERAL                                     I2C6   /*!< Peripheral name */
#define PINCTRL_BAT_IC_P1_86_SIGNAL                                      i2c_sda   /*!< Signal name */
#define PINCTRL_BAT_IC_P1_86_PIN_NAME                                  UART4_TXD   /*!< Routed pin name */
#define PINCTRL_BAT_IC_P1_86_LABEL                                     "BAT_SDA"   /*!< Label */
#define PINCTRL_BAT_IC_P1_86_NAME                                        "P1_86"   /*!< Identifier */

/* SD2_CD_B (number AD29), PD\RST */
/* Routed pin properties */
#define PINCTRL_FRAM_P2_92_PERIPHERAL                                      GPIO2   /*!< Peripheral name */
#define PINCTRL_FRAM_P2_92_SIGNAL                                        gpio_io   /*!< Signal name */
#define PINCTRL_FRAM_P2_92_CHANNEL                                            12   /*!< Signal channel */
#define PINCTRL_FRAM_P2_92_PIN_NAME                                     SD2_CD_B   /*!< Routed pin name */
#define PINCTRL_FRAM_P2_92_LABEL                                       "PD\\RST"   /*!< Label */
#define PINCTRL_FRAM_P2_92_NAME                                          "P2_92"   /*!< Identifier */
#define PINCTRL_FRAM_P2_92_DIRECTION                         kGPIO_DigitalOutput   /*!< Direction */

