teleportboy/arm7_adc_imx8mp/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define PINCTRL_FRAM_P2_92_GPIO                                            GPIO2   /*!< GPIO peripheral base pointer */
#define PINCTRL_FRAM_P2_92_GPIO_PIN                                          12U   /*!< GPIO pin number */
#define PINCTRL_FRAM_P2_92_GPIO_PIN_MASK                             (1U << 12U)   /*!< GPIO pin mask */

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif


/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_hog(void);                                    /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_backlight(void);                              /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_adc(void);                                    /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_fec(void);                                    /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_flexcan1(void);                               /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_flexcan2(void);                               /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_gpio_led(void);                               /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_lpddr4(void);                                 /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_earc(void);                                   /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_hdmi(void);                                   /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_i2c1(void);                                   /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_i2c2(void);                                   /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_i2c5(void);                                   /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
//void pinctrl_jtag(void);                                   /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_lvds0(void);                                  /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_pmic(void);                                   /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_flexspi0(void);                               /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_sai3_audio(void);                             /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_sai5_mic(void);                               /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_snvs(void);                                   /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_wdog(void);                                   /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_uart1_485(void);                              /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_uart2_gnss1(void);                            /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_uart3_gnss2(void);                            /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_uart4_485(void);                              /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_usb1_vbus(void);                              /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_usdhc2(void);                                 /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_usdhc3(void);                                 /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_usb1(void);                                   /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_usb2(void);                                   /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_bat_ic(void);                                 /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_eqos(void);                                   /*!< Function assigned for the core: Cortex-A53[a53_0] */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void pinctrl_fram(void);                                   /*!< Function assigned for the core: Cortex-A53[a53_0] */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
